artillery.yml
config:
  target: "http://localhost:80"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - put:
          url: "/api"
          json:
            key: "artillery_{{ $randomInt(1,10000) }}"
            value: "value_{{ $randomInt(1,10000) }}"
      - get:
          url: "/api/artillery_{{ $lastRequest.json.key }}"
      - delete:
          url: "/api/artillery_{{ $lastRequest.json.key }}"