load-test.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "PUT/GET/DELETE flow"
    flow:
      - post:
          url: "/api"
          json:
            key: "kv_{{ $randomString() }}"
            value: "val_{{ $randomString() }}"
          expect:
            - statusCode: 200
            - hasProperty: "message"
      - get:
          url: "/api/{{ $lastRequest.json.key }}"
          expect:
            - statusCode: 200
            - hasProperty: "data"
            - hasProperty: "data.value"
      - delete:
          url: "/api/{{ $lastRequest.json.key }}"
          expect:
            - statusCode: 200
            - hasProperty: "message"